serabiasin/microcontroller_project/stm32f103/lcd_project/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_conf.h"

#include "lib_lcd.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define pinRW_Pin GPIO_PIN_10
#define pinRW_GPIO_Port GPIOB
#define pinRS_Pin GPIO_PIN_11
#define pinRS_GPIO_Port GPIOB
#define pinD7_Pin GPIO_PIN_12
#define pinD7_GPIO_Port GPIOB
#define pinD6_Pin GPIO_PIN_13
#define pinD6_GPIO_Port GPIOB
#define pinD5_Pin GPIO_PIN_14
#define pinD5_GPIO_Port GPIOB
#define pinD4_Pin GPIO_PIN_15
#define pinD4_GPIO_Port GPIOB
#define pinD3_Pin GPIO_PIN_9
#define pinD3_GPIO_Port GPIOA
#define pinD2_Pin GPIO_PIN_11
#define pinD2_GPIO_Port GPIOA
#define pinD1_Pin GPIO_PIN_12
#define pinD1_GPIO_Port GPIOA
#define pinD0_Pin GPIO_PIN_6
#define pinD0_GPIO_Port GPIOB
#define pinEN_Pin GPIO_PIN_9
#define pinEN_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
